{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [3], "dtype": "float32"}, {"name": "conv1d_4/kernel", "shape": [5, 3, 48], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [48], "dtype": "float32"}, {"name": "conv1d_5/kernel", "shape": [5, 48, 64], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_6/kernel", "shape": [3, 64, 96], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [96], "dtype": "float32"}, {"name": "cu_dnnlstm_1/kernel", "shape": [96, 512], "dtype": "float32"}, {"name": "cu_dnnlstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "cu_dnnlstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "cu_dnnlstm_2/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "cu_dnnlstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "cu_dnnlstm_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [256, 345], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [345], "dtype": "float32"}]}]}